{
    "global": {
        "Machine Learning": "bidang kecerdasan buatan yang berfokus pada memungkinkan komputer belajar dari data tanpa diprogram secara eksplisit. Hal ini dicapai dengan mengembangkan algoritma yang secara otomatis dapat mengekstrak pola dan membuat prediksi dari data. Pembelajaran mesin digunakan dalam berbagai macam aplikasi, termasuk pemfilteran spam, deteksi penipuan, diagnosis medis, dan pengenalan gambar.",
        "Deep Learning": "Deep Learning adalah bagian dari pembelajaran mesin yang menggunakan jaringan saraf tiruan untuk belajar dari data. Jaringan saraf tiruan terinspirasi oleh struktur dan fungsi otak manusia, dan terdiri dari lapisan node yang saling berhubungan yang dapat memproses dan mengirimkan informasi. Pembelajaran mendalam sangat berhasil dalam aplikasi seperti pengenalan gambar, pemrosesan bahasa alami, dan pengenalan ucapan.",
        "Perbedaan Machine Learning dengan Deep Learning": "<b>Machine learning</b> adalah bidang yang luas yang mencakup berbagai teknik untuk mempelajari dari data. Teknik-teknik ini dapat dibagi menjadi dua kategori utama<br>Learning from supervised data: Metode ini menggunakan data yang telah diberi label untuk melatih model. Model kemudian dapat digunakan untuk memprediksi label data baru.<br>Learning from unsupervised data: Metode ini menggunakan data yang tidak diberi label untuk melatih model. Model kemudian dapat digunakan untuk menemukan pola atau struktur dalam data.<br><br><b>Deep learning</b> adalah subset dari machine learning yang menggunakan jaringan saraf tiruan (neural network) untuk mempelajari dari data. Jaringan saraf tiruan adalah model matematika yang terinspirasi dari otak manusia.<br><br><b>Perbedaan</b> utama antara machine learning dan deep learning adalah bahwa deep learning menggunakan jaringan saraf tiruan yang kompleks untuk mempelajari dari data. Jaringan saraf tiruan ini dapat memiliki banyak lapisan, yang memungkinkan mereka untuk mempelajari hubungan kompleks antara fitur data.",
        "Data": "Data adalah kumpulan informasi yang digunakan untuk melatih model machine learning. Data dapat berupa teks, gambar, audio, atau video.",
        "Model": "Model machine learning adalah serangkaian algoritma yang digunakan untuk memprediksi atau mengklasifikasikan data.",
        "Pelatihan": "Pelatihan adalah proses mengajarkan model machine learning untuk memprediksi atau mengklasifikasikan data.",
        "Evaluasi": "Evaluasi adalah proses menilai kinerja model machine learning.",
        "Prediksi": "Prediksi adalah proses menggunakan model machine learning untuk memprediksi nilai atau hasil di masa depan.",
        "Klasifikasi": "Klasifikasi adalah proses menggunakan model machine learning untuk mengklasifikasikan data ke dalam beberapa kategori.",
        "Regresi": "Regresi adalah proses menggunakan model machine learning untuk memprediksi nilai kontinu.",
        "Ensembling": "Ensembling adalah teknik menggabungkan hasil dari beberapa model machine learning untuk meningkatkan kinerja.",
        "Overfitting": "Overfitting adalah masalah yang terjadi ketika model machine learning terlalu dilatih pada data pelatihan sehingga tidak dapat generalisasi dengan baik ke data baru.",
        "Underfitting": "Underfitting adalah masalah yang terjadi ketika model machine learning tidak cukup dilatih pada data pelatihan sehingga tidak dapat memprediksi data dengan baik.",
        "Atribut": "Atribut adalah fitur dari data yang digunakan untuk melatih model machine learning.",
        "Label": "Label adalah nilai yang dikaitkan dengan data untuk digunakan dalam proses klasifikasi.",
        "Fitur": "Fitur adalah istilah umum yang digunakan untuk merujuk pada atribut atau label.",
        "Himpunan data": "Himpunan data adalah kumpulan data yang digunakan untuk melatih atau mengevaluasi model machine learning.",
        "Himpunan pelatihan": "Himpunan pelatihan adalah kumpulan data yang digunakan untuk melatih model machine learning.",
        "Himpunan uji": "Himpunan uji adalah kumpulan data yang digunakan untuk mengevaluasi kinerja model machine learning.",
        "Himpunan validasi": "Himpunan validasi adalah kumpulan data yang digunakan untuk mengevaluasi kinerja model machine learning selama proses pelatihan.",
        "Algoritma": "Algoritma adalah serangkaian langkah-langkah yang digunakan untuk menyelesaikan masalah.",
        "Kesalahan": "Kesalahan adalah selisih antara prediksi model machine learning dan nilai sebenarnya dari data.",
        "Akurasi": "Akurasi adalah ukuran kinerja model machine learning yang menghitung proporsi data yang diprediksi dengan benar.",
        "Recall": "Recall adalah ukuran kinerja model machine learning yang menghitung proporsi data positif yang diprediksi dengan benar.",
        "Precision": "Precision adalah ukuran kinerja model machine learning yang menghitung proporsi prediksi positif yang benar."
    },
    "nb": {
        "Naive bayes": "Naive bayes adalah algoritma klasifikasi probabilistik yang didasarkan pada teorema Bayes.",
        "Teorema Bayes": "Teorema Bayes adalah teorema matematika yang digunakan untuk menghitung probabilitas suatu peristiwa berdasarkan probabilitas peristiwa lain yang terkait.",
        "Data pelatihan": "Data pelatihan adalah kumpulan data yang digunakan untuk melatih model naive bayes.",
        "Data uji": "Data uji adalah kumpulan data yang digunakan untuk mengevaluasi kinerja model naive bayes.",
        "Label": "Label adalah nilai yang dikaitkan dengan data untuk digunakan dalam proses klasifikasi.",
        "Prediksi": "Prediksi adalah proses menggunakan model naive bayes untuk memprediksi label data baru.",
        "Akurasi": "Akurasi adalah ukuran kinerja model naive bayes yang menghitung proporsi data yang diprediksi dengan benar.",
        "Recall": "Recall adalah ukuran kinerja model naive bayes yang menghitung proporsi data positif yang diprediksi dengan benar.",
        "Precision": "Precision adalah ukuran kinerja model naive bayes yang menghitung proporsi prediksi positif yang benar.",
        "Kelas": "Kelas adalah kategori yang dapat dimiliki oleh data.",
        "Fitur": "Fitur adalah atribut dari data yang digunakan untuk melatih model naive bayes.",
        "Probabilitas prior": "Probabilitas prior adalah probabilitas suatu kelas sebelum data pelatihan diberikan.",
        "Probabilitas posterior": "Probabilitas posterior adalah probabilitas suatu kelas setelah data pelatihan diberikan.",
        "Penyebaran probabilitas": "Penyebaran probabilitas adalah fungsi yang menggambarkan probabilitas nilai fitur."
    },
    "knn": {
        "K": "K adalah bilangan integer yang menentukan jumlah tetangga terdekat yang akan digunakan untuk memprediksi label data baru.",
        "KNN": "K-NN merupakan algoritma klasifikasi non-parametrik yang mengklasifikasikan titik data baru berdasarkan kelas mayoritas dari k tetangga terdekatnya. KNN mudah diterapkan dan efektif untuk berbagai macam tugas. Namun, KNN sensitif terhadap outlier dan memerlukan biaya komputasi yang mahal untuk kumpulan data yang besar.",
        "Kedekatan": "Kedekatan adalah ukuran jarak antara dua data.",
        "Data pelatihan": "Data pelatihan adalah kumpulan data yang digunakan untuk melatih model kNN.",
        "Data uji": "Data uji adalah kumpulan data yang digunakan untuk mengevaluasi kinerja model kNN.",
        "Label": "Label adalah nilai yang dikaitkan dengan data untuk digunakan dalam proses klasifikasi.",
        "Prediksi": "Prediksi adalah proses menggunakan model kNN untuk memprediksi label data baru.",
        "Akurasi": "Akurasi adalah ukuran kinerja model kNN yang menghitung proporsi data yang diprediksi dengan benar.",
        "Recall": "Recall adalah ukuran kinerja model kNN yang menghitung proporsi data positif yang diprediksi dengan benar.",
        "Precision": "Precision adalah ukuran kinerja model kNN yang menghitung proporsi prediksi positif yang benar.",
        "Euclidean distance": "Euclidean distance adalah ukuran jarak yang paling umum digunakan dalam kNN.",
        "Manhattan distance": "Manhattan distance adalah ukuran jarak yang menghitung jarak antara dua data menggunakan jumlah perbedaan absolut antara nilai fitur.",
        "Minkowski distance": "Minkowski distance adalah ukuran jarak umum lainnya yang dapat digunakan dalam kNN.",
        "Mahalanobis distance": "Mahalanobis distance adalah ukuran jarak yang mengambil mempertimbangkan korelasi antara fitur-fitur data."
    },
    "dt": {
        "Decision tree": "Decision tree adalah algoritma klasifikasi atau regresi yang menggunakan pohon keputusan untuk membuat prediksi.",
        "Pohon keputusan": "Pohon keputusan adalah struktur data hierarkis yang terdiri dari node dan cabang.",
        "Node": "Node adalah titik di pohon keputusan yang mewakili keputusan atau aksi.",
        "Cabang": "Cabang adalah jalur yang menghubungkan dua node.",
        "Label": "Label adalah nilai yang dikaitkan dengan node.",
        "Data pelatihan": "Data pelatihan adalah kumpulan data yang digunakan untuk melatih model decision tree.",
        "Data uji": "Data uji adalah kumpulan data yang digunakan untuk mengevaluasi kinerja model decision tree.",
        "Prediksi": "Prediksi adalah proses menggunakan model decision tree untuk memprediksi label data baru.",
        "Akurasi": "Akurasi adalah ukuran kinerja model decision tree yang menghitung proporsi data yang diprediksi dengan benar.",
        "Recall": "Recall adalah ukuran kinerja model decision tree yang menghitung proporsi data positif yang diprediksi dengan benar.",
        "Precision": "Precision adalah ukuran kinerja model decision tree yang menghitung proporsi prediksi positif yang benar.",
        "Gini impurity": "Gini impurity adalah ukuran ketidakmurnian node di pohon keputusan.",
        "Information gain": "Information gain adalah ukuran peningkatan informasi yang diperoleh dengan membagi node berdasarkan fitur tertentu.",
        "Entropy": "Entropy adalah ukuran ketidakpastian dalam data."
    }
}